#Посиановка задачи:
#        Определить возрастную категорию по значению возраста
if
#ЕСЛИ возраст < 5:
#        print('Baby')
elif
#ИНАЧЕ ЕСЛИ возраст < 12:
#        print('Schoolboy')
elif
#ИНАЧЕ ЕСЛИ возраст < 19:
#        print('Guy')
else
#ИНАЧЕ:
#        print("Возрослый чел")

Оператор or, «логическое ИЛИ», возвращает True, если хотя бы одно из условий истинно.
 elif current_hour >= 18 and current_hour <= 22:                       
        print('Добрый вечер!')
    
Оператор and, «логическое И», возвращает True только если оба условия истинны.
elif current_hour <= 5 or current_hour >= 23:
        print('Доброй ночи!')
